# Desafio 1

Para esse desafio, vamos trabalhar com o data set [Black Friday](https://www.kaggle.com/mehdidag/black-friday), que reúne dados sobre transações de compras em uma loja de varejo.

Vamos utilizá-lo para praticar a exploração de data sets utilizando pandas. Você pode fazer toda análise neste mesmo notebook, mas as resposta devem estar nos locais indicados.

> Obs.: Por favor, não modifique o nome das funções de resposta.

## _Set up_ da análise

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("black_friday.csv")

## Inicie sua análise a partir daqui

In [3]:
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

## Verificar a consistência das colunas

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 537577 entries, 0 to 537576
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     537577 non-null  int64
 1   Product_ID                  537577 non-null  object
 2   Gender                      537577 non-null  object
 3   Age                         537577 non-null  object
 4   Occupation                  537577 non-null  int64
 5   City_Category               537577 non-null  object
 6   Stay_In_Current_City_Years  537577 non-null  object
 7   Marital_Status              537577 non-null  int64
 8   Product_Category_1          537577 non-null  int64
 9   Product_Category_2          370591 non-null  float64
 10  Product_Category_3          164278 non-null  float64
 11  Purchase                    537577 non-null  int64
dtypes: float64(2), int64(5), object(5)
memory usage: 49.2+ MB

In [12]:
exploracao = pd.DataFrame({'colunas' : df.columns,
                   'tipos' : df.dtypes,
                   'missing' : df.isna().sum()})
exploracao

                                               colunas    tipos  missing
User_ID                                        User_ID    int64        0
Product_ID                                  Product_ID   object        0
Gender                                          Gender   object        0
Age                                                Age   object        0
Occupation                                  Occupation    int64        0
City_Category                            City_Category   object        0
Stay_In_Current_City_Years  Stay_In_Current_City_Years   object        0
Marital_Status                          Marital_Status    int64        0
Product_Category_1                  Product_Category_1    int64        0
Product_Category_2                  Product_Category_2  float64   166986
Product_Category_3                  Product_Category_3  float64   373299
Purchase                                      Purchase    int64        0

## Questão 1

Quantas observações e quantas colunas há no dataset? Responda no formato de uma tuple `(n_observacoes, n_colunas)`.

In [6]:
def q1():
    return df.shape

## Questão 2

Há quantas mulheres com idade entre 26 e 35 anos no dataset? Responda como um único escalar.

In [24]:
def q2():
    return df.query("Gender == 'F' and Age == '26-35'").shape[0]

## Questão 3

Quantos usuários únicos há no dataset? Responda como um único escalar.

In [8]:
def q3():
    return df.User_ID.nunique()

## Questão 4

Quantos tipos de dados diferentes existem no dataset? Responda como um único escalar.

In [9]:
def q4():
    return df.dtypes.nunique()

## Questão 5

Qual porcentagem dos registros possui ao menos um valor null (`None`, `ǸaN` etc)? Responda como um único escalar entre 0 e 1.

In [10]:
def q5():
    return (df.shape[0] - df.dropna().shape[0]) / df.shape[0]

## Questão 6

Quantos valores null existem na variável (coluna) com o maior número de null? Responda como um único escalar.

In [11]:
def q6():
    return int(df.isna().sum().max())

## Questão 7

Qual o valor mais frequente (sem contar nulls) em `Product_Category_3`? Responda como um único escalar.

In [11]:
def q7():
    return df.Product_Category_3.mode()[0]

## Questão 8

Qual a nova média da variável (coluna) `Purchase` após sua normalização? Responda como um único escalar.

In [13]:
def q8():
    purchase = df.Purchase
    purchase_norm = (purchase - purchase.min()) / (purchase.max() - purchase.min())
    return float(purchase_norm.mean())

## Questão 9

Quantas ocorrências entre -1 e 1 inclusive existem da variáel `Purchase` após sua padronização? Responda como um único escalar.

In [14]:
def q9():
    purchase_padronizado = (df.Purchase - df.Purchase.mean()) / df.Purchase.std()
    df_purchase_padron = pd.DataFrame(purchase_padronizado)
    return df_purchase_padron.query("Purchase >= -1 and Purchase <= 1").shape[0]

## Questão 10

Podemos afirmar que se uma observação é null em `Product_Category_2` ela também o é em `Product_Category_3`? Responda com um bool (`True`, `False`).

In [15]:
def q10():
    q10 = df[df['Product_Category_2'].isna()][['Product_Category_2','Product_Category_3']]
    return bool(q10.isnull().values.all())